//工厂模式：
//首先需要说一下工厂模式。工厂模式根据抽象程度的不同分为三种：简单工厂模式（也叫静态工厂模式）、本文所讲述的工厂方法模式、以及抽象工厂模式。工厂模式是编程中经常用到的一种模式。它的主要优点有：
//可以使代码结构清晰，有效地封装变化。在编程中，产品类的实例化有时候是比较复杂和多变的，通过工厂模式，将产品的实例化封装起来，使得调用者根本无需关心产品的实例化过程，只需依赖工厂即可得到自己想要的产品。
//对调用者屏蔽具体的产品类。如果使用工厂模式，调用者只关心产品的接口就可以了，至于具体的实现，调用者根本无需关心。即使变更了具体的实现，对调用者来说没有任何影响。
//降低耦合度。产品类的实例化通常来说是很复杂的，它需要依赖很多的类，而这些类对于调用者来说根本无需知道，如果使用了工厂方法，我们需要做的仅仅是实例化好产品类，然后交给调用者使用。对调用者来说，产品所依赖的类都是透明的。
//
//工厂方法模式：
//通过工厂方法模式的类图可以看到，工厂方法模式有四个要素：
//工厂接口。工厂接口是工厂方法模式的核心，与调用者直接交互用来提供产品。在实际编程中，有时候也会使用一个抽象类来作为与调用者交互的接口，其本质上是一样的。
//工厂实现。在编程中，工厂实现决定如何实例化产品，是实现扩展的途径，需要有多少种产品，就需要有多少个具体的工厂实现。
//产品接口。产品接口的主要目的是定义产品的规范，所有的产品实现都必须遵循产品接口定义的规范。产品接口是调用者最为关心的，产品接口定义的优劣直接决定了调用者代码的稳定性。同样，产品接口也可以用抽象类来代替，但要注意最好不要违反里氏替换原则。
//产品实现。实现产品接口的具体类，决定了产品在客户端中的具体行为。
//前文提到的简单工厂模式跟工厂方法模式极为相似，区别是：简单工厂只有三个要素，他没有工厂接口，并且得到产品的方法一般是静态的。因为没有工厂接口，所以在工厂实现的扩展性方面稍弱，可以算所工厂方法模式的简化版，关于简单工厂模式，在此一笔带过。
//
//适用场景：
//不管是简单工厂模式，工厂方法模式还是抽象工厂模式，他们具有类似的特性，所以他们的适用场景也是类似的。
//首先，作为一种创建类模式，在任何需要生成复杂对象的地方，都可以使用工厂方法模式。有一点需要注意的地方就是复杂对象适合使用工厂模式，而简单对象，特别是只需要通过new就可以完成创建的对象，无需使用工厂模式。如果使用工厂模式，就需要引入一个工厂类，会增加系统的复杂度。
//其次，工厂模式是一种典型的解耦模式，迪米特法则在工厂模式中表现的尤为明显。假如调用者自己组装产品需要增加依赖关系时，可以考虑使用工厂模式。将会大大降低对象之间的耦合度。
//再次，由于工厂模式是依靠抽象架构的，它把实例化产品的任务交由实现类完成，扩展性比较好。也就是说，当需要系统有比较好的扩展性时，可以考虑工厂模式，不同的产品用不同的实现工厂来组装。
//
//典型应用
//要说明工厂模式的优点，可能没有比组装汽车更合适的例子了。场景是这样的：汽车由发动机、轮、底盘组成，现在需要组装一辆车交给调用者。

//区别 
//工厂方法模式：
//一个抽象产品类，可以派生出多个具体产品类。   
//一个抽象工厂类，可以派生出多个具体工厂类。   
//每个具体工厂类只能创建一个具体产品类的实例。
//抽象工厂模式：
//多个抽象产品类，每个抽象产品类可以派生出多个具体产品类。   
//一个抽象工厂类，可以派生出多个具体工厂类。   
//每个具体工厂类可以创建多个具体产品类的实例。   
//区别：
//工厂方法模式只有一个抽象产品类，而抽象工厂模式有多个。   
//工厂方法模式的具体工厂类只能创建一个具体产品类的实例，而抽象工厂模式可以创建多个。

#include "stdafx.h"
#include <stdlib.h>
#include <iostream>
#include "PizzaStore.h"
#include "AmericaStore.h"
#include "ChinaStore.h"

using namespace std;

int _tmain(int argc, _TCHAR* argv[])
{
	//创建中国比萨工厂
	PizzaStore *pChinaStore = new ChinaStore();
	cout << endl;
	//生产中国比萨
	pChinaStore->OrderPizza( "中国比萨" );
	cout << endl;
	//生产美国比萨
	pChinaStore->OrderPizza( "美国比萨" );

	cout << endl;

	//创建美国比萨工厂
	PizzaStore *pAmericaStore = new AmericaStore();
	cout << endl;
	//生产中国比萨
	pAmericaStore->OrderPizza( "中国比萨" );
	cout << endl;
	//生产美国比萨
	pAmericaStore->OrderPizza( "美国比萨" );

	cout << endl;

	//销毁中国比萨工厂
	delete pChinaStore;
	pChinaStore = NULL;

	//销毁美国比萨工厂
	delete pAmericaStore;
	pAmericaStore = NULL;
	
	cout << endl;

	system("pause");
	return 0;
}

